# CurtainSystemCouldnotReacquireFaces Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainGridFamilyFailures..::..CurtainSystemCouldnotReacquireFaces Property
BuiltInFailures..::..CurtainGridFamilyFailures Class See Also
---
Curtain System could not reacquire [Number] faces out of [Number].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CurtainSystemCouldnotReacquireFaces { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainSystemCouldnotReacquireFaces As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CurtainSystemCouldnotReacquireFaces {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace